import React from "react";

const Terms = () => {
  return (
    <div className={"flex flex-col gap-12"}>
      <h2 className="text-xl md:text-2xl font-bold text-neutral-900">
        이용약관
      </h2>
      <div className="flex flex-col gap-2">
        <p className={"text-base text-neutral-800"}>
          이 약관은 주식회사 대은계전(이하 &quot;서비스 제공자&quot;)가 무료
          서비스로 만든 모바일 기기용 아라서팜 앱(이하
          &quot;애플리케이션&quot;)에 적용됩니다.
        </p>
        <p className={"text-base text-neutral-800"}>
          애플리케이션을 다운로드하거나 사용하면 다음 약관에 자동으로 동의하게
          됩니다. 애플리케이션을 사용하기 전에 이 약관을 철저히 읽고 이해하는
          것이 좋습니다.
        </p>
        <p className={"text-base text-neutral-800"}>
          무단 복제, 애플리케이션 수정, 애플리케이션의 일부 또는 당사 상표는
          엄격히 금지됩니다. 애플리케이션의 소스 코드를 추출하거나
          애플리케이션을 다른 언어로 번역하거나 파생 버전을 만들려는 시도는
          허용되지 않습니다. 애플리케이션과 관련된 모든 상표, 저작권,
          데이터베이스 권리 및 기타 지적 재산권은 서비스 제공자의 소유로 남아
          있습니다.
        </p>
        <p className={"text-base text-neutral-800"}>
          서비스 제공업체는 애플리케이션이 최대한 유익하고 효율적으로 작동하도록
          최선을 다하고 있습니다. 따라서 언제, 어떤 이유로든 애플리케이션을
          수정하거나 서비스에 대한 요금을 청구할 수 있는 권리를 보유합니다.
          서비스 제공업체는 애플리케이션 또는 서비스에 대한 요금이 명확하게
          사용자에게 전달되도록 보장합니다.
        </p>
        <p className={"text-base text-neutral-800"}>
          애플리케이션은 서비스 제공업체에 제공한 개인 데이터를 저장하고
          처리하여 서비스를 제공합니다. 휴대폰의 보안과 애플리케이션에 대한
          액세스를 유지하는 것은 사용자의 책임입니다. 서비스 제공업체는 기기의
          공식 운영 체제에서 부과하는 소프트웨어 제한과 제한을 제거하는 것과
          관련하여 휴대폰을 탈옥하거나 루팅하지 말 것을 강력히 권장합니다.
          이러한 행위는 휴대폰을 악성 소프트웨어, 바이러스, 악성 프로그램에
          노출시키고 휴대폰의 보안 기능을 손상시킬 수 있으며, 애플리케이션이
          올바르게 또는 전혀 작동하지 않을 수 있습니다.
        </p>
        <p className={"text-base text-neutral-800"}>
          애플리케이션은 자체 약관이 있는 타사 서비스를 활용합니다. 아래는
          애플리케이션에서 사용하는 타사 서비스 제공업체의 약관 링크입니다:
        </p>
        <p className={"text-base text-neutral-800"}>
          * [엑스포](https://expo.io/terms)
        </p>
        <p className={"text-base text-neutral-800"}>
          서비스 제공자는 특정 측면에 대해 책임을 지지 않습니다. 애플리케이션의
          일부 기능은 Wi-Fi 또는 모바일 네트워크 제공자가 제공하는 활성 인터넷
          연결이 필요합니다. Wi-Fi에 대한 액세스 부족으로 인해 애플리케이션이
          최대 용량으로 작동하지 않거나 데이터 허용량을 소진한 경우 서비스
          제공자는 책임을 질 수 없습니다.
        </p>
        <p className={"text-base text-neutral-800"}>
          Wi-Fi 영역 이외의 지역에서 애플리케이션을 사용하는 경우 모바일
          네트워크 제공업체의 계약 조건이 여전히 적용된다는 점을 유의하시기
          바랍니다. 따라서 애플리케이션에 연결하는 동안 데이터 사용에 대한
          요금이나 기타 타사 요금이 모바일 제공업체로부터 부과될 수 있습니다.
          애플리케이션을 사용함으로써 데이터 로밍을 비활성화하지 않고 본국(예:
          지역 또는 국가) 이외의 지역에서 애플리케이션을 사용하는 경우 로밍
          데이터 요금을 포함한 모든 요금에 대한 책임을 집니다. 애플리케이션을
          사용하는 디바이스의 청구인이 아닌 경우 청구인의 허가를 받은 것으로
          간주합니다.
        </p>
        <p className={"text-base text-neutral-800"}>
          마찬가지로 서비스 제공자가 항상 애플리케이션 사용에 대한 책임을 질
          수는 없습니다. 예를 들어, 기기가 계속 충전되어 있는지 확인하는 것은
          사용자의 책임입니다. 기기의 배터리가 부족하여 서비스에 액세스할 수
          없는 경우 서비스 제공자는 책임을 질 수 없습니다.
        </p>
        <p className={"text-base text-neutral-800"}>
          서비스 제공자가 애플리케이션을 사용하는 것에 대한 책임과 관련하여,
          서비스 제공자는 애플리케이션이 항상 업데이트되고 정확하도록
          노력하지만, 사용자가 애플리케이션을 사용할 수 있도록 정보를 제공하기
          위해 제3자에게 의존하고 있다는 점을 유의해야 합니다. 서비스 제공자는
          애플리케이션의 이 기능에 전적으로 의존하여 발생하는 모든 손실에 대해
          직접적이든 간접적이든 책임을 지지 않습니다.
        </p>
        <p className={"text-base text-neutral-800"}>
          이 애플리케이션은 특정 기능이나 서비스를 제공하기 위해 인공지능(AI)
          기술을 통합합니다. 애플리케이션을 사용하면 데이터를 처리하고 기능을
          제공하는 데 AI가 사용될 수 있음을 인정하고 동의할 수 있습니다. 서비스
          제공업체는 모든 AI 사용이 관련 법률을 준수하고 사용자 경험에 도움이
          되도록 설계되었습니다.
        </p>
        <p className={"text-base text-neutral-800"}>
          서비스 제공자는 언젠가 애플리케이션을 업데이트하고자 할 수 있습니다.
          운영 체제(및 애플리케이션의 가용성을 연장하기로 결정한 추가 시스템)의
          요구 사항에 따라 현재 애플리케이션을 사용할 수 있으며, 애플리케이션을
          계속 사용하려면 업데이트를 다운로드해야 합니다. 서비스 제공자는
          애플리케이션이 항상 업데이트되어 사용자에게 관련성이 있거나 장치에
          설치된 특정 운영 체제 버전과 호환되도록 보장하지 않습니다. 그러나
          사용자가 제안할 때 애플리케이션에 대한 업데이트를 항상 수락하는 것에
          동의합니다. 서비스 제공자는 또한 애플리케이션 제공을 중단하고 제공
          없이 언제든지 사용을 종료할 수 있습니다
        </p>
      </div>
    </div>
  );
};

export default Terms;
